{"chunks": ["﻿The Indian Penal Code (PB), 36th ed\n\n\n\n\n\n\n\nRatanlal & Dhirajlal: Indian Penal Code (PB) / THE INDIAN PENAL CODE\n\n\nCurrency Date: 28 April 2020\n\n© 2020 LexisNexis\n\n\n(ACT XLV OF 1860)\n\n[Received the assent of the Governor-General on October 6, 1860.]\n\n\nCHAPTER I INTRODUCTION\n\nThe Indian Penal Code was drafted by the First Indian Law Commission presided over by Lord Thomas Babington Macaulay. The draft underwent further revision at the hands of well-known jurists, like Sir Barnes Peacock, and was ", "completed in 1850. The Indian Penal Code was passed by the then Legislature on 6 October 1860 and was enacted as Act No. XLV of 1860.\n\nPreamble.\tWHEREAS it is expedient to provide a general Penal Code for India; It is enacted as follows:—\nCOMMENT.—The Indian Penal Code, 1860 (IPC, 1860) exhaustively codifies the law relating to offences with which it deals and the rules of the common law cannot be resorted to for inventing exemptions which are not expressly enacted.1. It is not necessary and ind", "eed not permissible to construe the IPC, 1860 at the present day in accordance with the notions of criminal jurisdiction prevailing at the time when the Code was enacted. The notions relating to this matter have very considerably changed between then and now during nearly a century that has elapsed. It is legitimate to construe the Code with reference to the modern needs, wherever this is permissible, unless there is anything in the Code or in any particular section to indicate the contrary.2.\n\n", "[s 1] Title and extent of operation of the Code.\n\nThis Act shall be called the Indian Penal Code, and shall 3.[extend to the whole of India 4.[except the State of Jammu and Kashmir].]\n\n\n\n\n\n\n\n1. MC Verghese v Ponnan, AIR 1970 SC 1876 [LNIND 1968 SC 339] : (1969) 1 SCC 37 [LNIND\n1968 SC 339] : 1970 Cr LJ 1651 .\n2. Mobarik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC).\n3. The original words have successively been amended by Act 12 of 1891, section 2 and Sch I, the", " A.O. 1937, the A.O. 1948 and the A.O. 1950 to read as above.\n4. Subs. by Act 3 of 1951, section 3 and Sch, for \"except Part B States\" (w.e.f. 1-4-1951).\n5. 9 Geo. IV, section 74; Acts VII and XIX of 1837; Act XXXI of 1838; Acts XXII and XXXI of 1839; Acts VII and X of 1844; Act XVI of 1852. See Pramod Kumar, Perspectives of the New Bill on Indian Penal Code and Reflections on the Joint Select Committee Report—Some Comments, (1980) 22 JILI 307.\n6. XIV of 1827.\n7. Section 4(1) Code of Criminal Pr", "ocedure, 1973. Also see commentary under section 3 of IPC\ninfra.\n8. Sangeetaben Mahendrabhai Patel v State of Gujarat, AIR 2012 SC 2844 [LNIND 2012 SC 1473]\n: (2012) 7 SCC 621 [LNIND 2012 SC 1473] .\n9. Mohammed Ajmal Mohammad Amir Kasab v State of Maharashtra, (2012) 9 SCC 1 [LNIND 2012 SC 1215] : AIR 2012 (SCW) 4942 : AIR 2012 SC 3565 [LNIND 2012 SC 1215] : 2012 Cr LJ\n4770 : JT 2012 (8) SC 4 [LNIND 2012 SC 1215] : 2012 (7) Scale 553 [relied on State (NCT of\nDelhi) v Navjot Sandhu @ Afsan Guru, ", "AIR 2005 SC 3820 [LNIND 2005 SC 580] : (2005) 11 SCC\n600 [LNIND 2005 SC 580] : (2005) 2 SCC (Cr) 1715]\n10. Natarajan v State, (2008) 8 SCC 413 [LNIND 2008 SC 1093] : (2008) 3 SCC (Cr) 507.\n\n\nPreamble.\tWHEREAS it is expedient to provide a general Penal Code for India; It is enacted as follows:—\nCOMMENT.—The Indian Penal Code, 1860 (IPC, 1860) exhaustively codifies the law relating to offences with which it deals and the rules of the common law cannot be resorted to for inventing exemptions which ", "are not expressly enacted.1. It is not necessary and indeed not permissible to construe the IPC, 1860 at the present day in accordance with the notions of criminal jurisdiction prevailing at the time when the Code was enacted. The notions relating to this matter have very considerably changed between then and now during nearly a century that has elapsed. It is legitimate to construe the Code with reference to the modern needs, wherever this is permissible, unless there is anything in the Code or", " in any particular section to indicate the contrary.2.\n\n[s 2] Punishment of offences committed within India.\n\nEvery person 1 shall be liable to punishment under this Code and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within 11.[India] 12.[***]. 2\n\n\n\nCOMMENT—\n\nThis section deals with the intraterritorial operation of the Code. It makes the Code universal in its application to every person in any part of India for every act or omission ", "contrary to the provisions of the Code.\nSection 2 read with section 4 of the IPC, 1860 makes the provisions of the Code applicable to the offences committed \"in any place without and beyond\" the territory of India; (1) by a citizen of India or (2) on any ship or aircraft registered in India, irrespective of its location, by any person not necessarily a citizen. Such a declaration was made as long back as in 1898. By an amendment in 2009 to the said section, the Code is extended to any person in ", "any place \"without and beyond the territory of India\", committing an offence targeting a computer resource located in India.13.\n1. 'Every person'.—Every person is made liable to punishment, without distinction of nation, rank, caste or creed, provided the offence with which he is charged has been committed in some part of India. A foreigner who enters the Indian territories and thus, accepts the protection of Indian laws virtually gives an assurance of his fidelity and obedience to them and subm", "its himself to their operation. It is no defence on behalf of a foreigner that he did not know he was doing wrong, the act not being an offence in his own country. A foreigner who commits an offence within India is guilty and can be\n\npunished as such without any limitation as to his corporal presence in India at the time.14. Indian Courts have jurisdiction against foreigners residing in foreign countries but their acts connected with transaction or part of transaction arising in India.15.\n\n[s 2.", "1] Corporate Criminal Liability\n\nA company is liable to be prosecuted and punished for criminal offences. Although there are earlier authorities to the fact that the corporation cannot commit a crime, the generally accepted modern rule is that a corporation may be subject to indictment and other criminal process although the criminal act may be committed through its agent. The majority in the Constitution bench held that there is no immunity to the companies from prosecution merely because the p", "rosecution is in respect of offences for which the punishment is mandatory imprisonment and fine.16. When imprisonment and fine is prescribed as punishment the Court can impose the punishment of fine which could be enforced against the company.17.\n\nIn CBI v Blue Sky Tie-up Pvt Ltd,18. the question again came up for consideration before the Supreme Court and it was held that since the majority of the Constitution Bench ruled in Standard Chartered Bank v Directorate of Enforcement [supra] that the", " company can be prosecuted even in a case where the Court can impose substantive sentence as also fine, and in such case only fine can be imposed on the corporate body, the contrary view taken by the learned single Judge cannot be approved.\n\n\n\n[s 2.2] Vicarious Liability.—\n\nIndian Penal Code, save and except some matters does not contemplate any vicarious liability on the part of a person. Commission of an offence by raising a legal fiction or by creating a vicarious liability in terms of the pr", "ovisions of a statute must be expressly stated. The Managing Director or the Directors of the Company, thus, cannot be said to have committed an offence only because they are holders of offices.19. Vicarious liability of the Managing Director and Director would arise provided any provision exists in that behalf in the statute. Statutes indisputably must contain provision fixing such vicarious liabilities. Even for the said purpose, it is obligatory on the part of the complainant to make requisit", "e allegations which would attract the provisions constituting vicarious liability.20. The provisions of the Essential Commodities Act, 1955, Negotiable Instruments Act, 1881, Employees' Provident Fund (Miscellaneous Provision) Act, 1952, etc., have created such vicarious liability. It is interesting to note that section 14A of the 1952 Act specifically creates an offence of criminal breach of trust in respect of the amount deducted from the employees by the company. In terms of the explanations ", "appended to section 405 of the IPC, 1860 a legal fiction has been created to the effect that the employer shall be deemed to have committed an offence of criminal breach of trust. Whereas a person in charge of the affairs of the company and in control thereof has been made vicariously liable for the offence committed by the company along with the company but even in a case falling under section 406 of the IPC, 1860 vicarious liability has been held to be not extendable to the Directors or office", "rs of the company.21.\nThere is no exception in favour of anyone in the Penal Code, but the following persons are exempted from the jurisdiction of criminal Courts of every country:—\n(a) Foreign Sovereigns.—The real principle on which the exemption, of every sovereign from the jurisdiction of every Court, has been deduced is that the exercise of such jurisdiction would be incompatible with his regal dignity—that is to say, with his absolute independence of every superior authority.22.\n\n(b) Diplom", "ats.—United Nations Privileges and Immunities Act, 1947, and the Diplomatic Relations (Vienna Convention) Act, 1972, gave certain diplomats, missions and their member's diplomatic immunity even from criminal jurisdiction. The Diplomatic Relations (Vienna Convention) Act had been enacted to give effect to the Vienna Convention on Diplomatic Relations, 1961. The effect of section 2 of the Act is to give the force of law in India to certain provisions set out in the Schedule to the Act.\nA diplomati", "c agent shall enjoy immunity from the criminal jurisdiction of the receiving State. He shall also enjoy immunity from its civil and administrative jurisdiction except in the case of:\n\n(i) A real action relating to private immovable property situated in the territory of the receiving State, unless he holds it on behalf of the sending State for the purposes of the mission;\n(ii) An action relating to succession in which the diplomatic agent is involved as executor, administrator, heir or legatee as", " a private person and not on behalf of the sending State;\n(iii) An action relating to any professional or commercial activity exercised by the diplomatic agent in the receiving State outside his official functions.23. A diplomatic agent is not obliged to give evidence as a witness.24. Privileges and immunities are conferred on United Nations and its Representatives as well as on other international organisations and their representatives by the United Nations (Privileges and Immunities) Act, 194", "7.25.\n(c) Alien enemies.—In respect of acts of war alien enemies cannot be tried by criminal Courts. If an alien enemy commits a crime unconnected with war, e.g., theft, he would be triable by ordinary criminal Courts.\n(d) Foreign army.—When armies of one State are by consent on the soil of a foreign State they are exempted from the jurisdiction of the State on whose soil they are.\n(e) Warships.—Men-of-war of a State in foreign waters are exempt from the jurisdiction of the State within whose te", "rritorial jurisdiction they are. The domestic Courts, in accordance with principles of international law, will accord to the ship and its crew and its contents certain immunities. The immunities can, in any case, be waived by the nation to which the public ship belongs.26.\n(f) President and Governors.—Under Article 361 of the Indian Constitution, the President and Governors are exempt from the jurisdiction of Courts.\n2. 'Within India'.—If the offence is committed outside India it is not punishab", "le under the Penal Code, unless it has been made so by means of special provisions such as sections 3, 4, 108A, etc., of the Code. Under section179 of the Cr PC, 1973 even the place(s) wherein the consequence (of the criminal act) \"ensues\" would be relevant to determine the Court of competent jurisdiction. Therefore, even the Courts within whose local jurisdiction, the repercussion/effect of the criminal act occurs, would have jurisdiction in the matter. When the consequence of an act committed ", "by a foreigner outside India if ensued in India, he can be tried in India.27. Normally crime carries the person. The commission of a crime gives the Court of the place where it is committed jurisdiction over the person of the offender.28.\n\n\n\n[s 2.3] Territorial jurisdiction.—\n\nThe territory of India is defined under Article 1 of the Constitution of India. Article 1 of the Constitution of India deals only with the geographical territory while Article 297 deals with 'maritime territory'.\nArticle 2", "97(3) authorises the Parliament to specify from time to time the limits of various maritime zones such as, territorial waters, continental shelf, etc. Clauses (1) and (2) of the said Article make a declaration that all lands, minerals and other things of value and all other resources shall vest in the Union of India.29. Section 18 of the IPC, 1860 defines India as the territory of India excluding the state of Jammu and Kashmir. These territorial limits would include the territorial waters of Ind", "ia.30. Under the General Clauses Act, 1897, India is defined to mean all territories for the time being comprised in the territory of India as defined in the Constitution of India. Under the provisions of Article 297 of the Constitution of India, all lands, minerals and other things of value underlying the ocean within the territorial waters or the continental shelf or the exclusive economic zone of India vest in the Union. The Constitution of India does not itself define the terms territorial w", "aters, continental shelf, and exclusive economic zone. Clause (3) of Article 297 states that their limits shall be such as may be specified by Parliament. In 1976, Parliament implemented the amendments to the Constitution of India by passing the Maritime Zones Act, 1976.31. Insofar the Republic of India is concerned, the limit of the territorial waters was initially understood to be three nautical miles. It had been extended subsequently; up to six nautical miles by a Presidential proclamation d", "ated 22 March 1952 and to 12 nautical miles by another proclamation dated 30 September 1967. By The Territorial Waters, Continental Shelf, Exclusive Economic Zone and Other Maritime Zones Act, 80 of 1976, it was statutorily fixed at 12 nautical miles. Section 3 of the Act stipulates that the sovereignty of India extends to the territorial waters, the limit of which is 12 nautical miles. Section 5 of the Territorial Waters Act, 1976 defines the contiguous zone of India as an area beyond and adjac", "ent to territorial waters to a distance of 24 nautical miles from the nearest point of the baseline. Section 7 of the Act defines the Exclusive economic zone of India as an area beyond and adjacent to territorial waters up to a limit of 200 nautical miles.32.\n\n\n\n[s 2.4] Jurisdiction beyond Territorial Waters\n\nIn the case of British India Steam Navigation Co Ltd v Shanmughavilas Cashew Industries,33. the Supreme Court examined the effective operation of the statutes of a country in relation to fo", "reigners and foreign ships.\nIn general, a statute extends territorially, unless the contrary is stated, throughout the country and will extend to the territorial waters, and such places as intention to that effect is shown. A statute extends to all persons within the country if that intention is shown. The Indian Parliament, therefore, has no authority to legislate for foreign vessels or foreigners in them on the high seas. Thus a foreign ship on the high seas, or her foreign owners or their age", "nts in a foreign country, are not deprived of rights by our statutory enactment expressed in general terms unless it provides that a foreign ship entering an Indian port or territorial waters and thus coming within the territorial jurisdiction is to be covered. Without anything more Indian statutes are ineffective against foreign property and foreigners outside the jurisdiction.\n\nIt is this principle which is reflected in section 2(2) of the Merchant Shipping Act, 1958.34.\nEarlier in Aban Loyd C", "hiles Offshore Ltd v UOI,35. it was held that India has been given only certain limited sovereign rights and such limited sovereign rights conferred on India in respect of continental shelf and exclusive economic zone cannot be equated to extending the sovereignty of India over the continental shelf and exclusive economic zone as in the case of territorial waters.\n\n\n\n\n\n1. MC Verghese v Ponnan, AIR 1970 SC 1876 [LNIND 1968 SC 339] : (1969) 1 SCC 37 [LNIND\n1968 SC 339] : 1970 Cr LJ 1651 .\n2. Mobar", "ik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC).\n11. The original words \"the said territories\" have successively been amended by the A.O. 1937, the A.O. 1948, the A.O. 1950 and Act 3 of 1951, section 3 and Sch (w.e.f. 3-4-1951), to read as above.\n12. The words and figures \"on or after the said first day of May, 1861\" rep. by Act 12 of 1891, section 2 and Sch I.\n13. Republic of Italy through Ambassador v UOI, (2013) 4 SCC 721 : 2013 (1) Scale 462\n[LNINDORD 2013", " SC 9114] .\n14. Mobarik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC).\nSee also State of Maharashtra v Mayer Hans George, 1965 (1) SCR 123 [LNIND 1964 SC 415] : AIR 1965 SC 722 [LNIND 1964 SC 208] : 1965 (1) Cr LJ 641 .\n15. Lee Kun Hee v State of UP, (2012) 3 SCC 132 [LNIND 2012 SC 89] : AIR 2012 SC 1007\n[LNINDORD 2012 SC 443] : 2012 Cr LJ 1551 .\n16. Standard Chartered Bank v Directorate of Enforcement, (2005) 4 SCC 530 [LNIND 2005 SC\n476] : AIR 2005 SC 2622 [L", "NIND 2005 SC 476] : 2005 SCC (Cr) 961; Asstt Commr v Velliappa\nTextiles Ltd, 2003 (11) SCC 405 [LNIND 2003 SC 794] : 2004 SCC (Cr) 1214) Overruled.\n17. Standard Chartered Bank v Directorate of Enforcement, AIR 2006 SC 1301 [LNIND 2006 SC 145] : (2006) 4 SCC 278 [LNIND 2006 SC 145] : (2006) 2 SCC (Cr) 221. See also CBI v Blue Sky\nTie-up Pvt Ltd, (2011) 6 Scale 436 : AIR 2012 (SCW) 1098 : 2012 Cr LJ 1216 . Also see Aneeta\nHada v Godfather Travels & Tours, (2012) 5 SCC 66 : 2012 Cr LJ 2525 : AIR 20", "12 SC 2795 [LNIND\n2012 SC 260] .\n18. CBI v Blue Sky Tie-up Pvt Ltd, (2011) 6 Scale 436 : AIR 2012 (SCW) 1098 : 2012 Cr LJ 1216 .\nAlso see Aneeta Hada v Godfather Travels & Tours, (2012) 5 SCC 66 : 2012 Cr LJ 2525 : AIR 2012 SC 2795 [LNIND 2012 SC 260] in which it is held that directors cannot be prosecuted without the Company being arraigned as an accused–138 NI Act.\n19. Keki Hormusji Gharda v Mehervan Rustom Irani, (2009) 6 SCC 475 [LNIND 2009 SC 1276] :\n2009 Cr LJ 3733 : AIR 2009 SC 2594 [LNIN", "D 2009 SC 1276] .\n20. Maksud Saiyed v State of Gujarat, (2008) 5 SCC 668 [LNIND 2007 SC 1090] : JT 2007 (11) SC\n276 [LNIND 2007 SC 1090] : (2008) 2 SCC (Cr) 692.\n21. SK Alagh v State of UP, AIR 2008 SC 1731 [LNIND 2008 SC 368] : (2008) 5 SCC 662 [LNIND\n2008 SC 368] : 2008 Cr LJ 2256 : (2008) 2 SCC (Cr) 686.\n22. Per Brett, LJ in The Parlement Belge, (1880) 5 PD 197 , 207.\n23. Article 31 (1) of Diplomatic Relations (Vienna Convention) Act, 1972.\n24. Article 31 (1) of Diplomatic Relations (Vienna C", "onvention) Act, 1972.\n25. United Nations (Privileges and Immunities) Act, Act No. XLV of 1947.\n26. Chung Chi Cheung, (1939) AC 160 .\n27. Lee Kun Hee v State of UP, (2012) 3 SCC 132 [LNIND 2012 SC 89] : AIR 2012 SC 1007 [LNINDORD 2012 SC 443] : 2012 Cr LJ 1551 ; Mobarik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC) : 1958 SCR 328 [LNIND 1957 SC 81] .\n\n28. Kubic Dariusz v UOI, AIR 1990 SC 605 [LNIND 1990 SC 25] : (1990) 1 SCC 568 [LNIND 1990\nSC 25] : 1990 Cr LJ 7", "96 .\n29. Republic of Italy through Ambassador v UOI, (2013) 4 SCC 721 : 2013 (1) Scale 462\n[LNINDORD 2013 SC 9114] .\n30. BK Wadeyar v Daulatram Rameshwarlal, AIR 1961 SC 311 [LNIND 1960 SC 493] : 1961 (1)\nSCR 924 [LNIND 1960 SC 493] .\n31. Aban Loyd Chiles Offshore Ltd v UOI, JT 2008 (5) SC 256 [LNIND 2008 SC 897] : 2008 (6)\nScale 128 [LNIND 2008 SC 897] : (2008) 11 SCC 439 [LNIND 2008 SC 897] .\n32. UOI Republic of Italy through Ambassador v UOI, (2013) 4 SCC 721 : 2013 (1) Scale 462\n[LNINDORD 20", "13 SC 9114] .\n33. British India Steam Navigation Co Ltd v Shanmughavilas Cashew Industries, 1990 (3) SCC 481 [LNIND 1990 SC 150] : JT 1990 (1) SC 528 [LNIND 1990 SC 150] : 1990 (1) SCR 884 .\n34. World Tanker Carrier Corp v SNP Shipping Services Pvt Ltd, AIR 1998 SC 2330 [LNIND 1998\nSC 461] : 1998 (5) SCC 310 [LNIND 1998 SC 461] .\n35. Aban Loyd Chiles Offshore Ltd v UOI, (2008) 11 SCC 439 [LNIND 2008 SC 897] : JT 2008 (5)\nSC 256 [LNIND 2008 SC 897] : 2008 (6) Scale 128 [LNIND 2008 SC 897] .\n\nTHE ", "INDIAN PENAL CODE\n\nCHAPTER I INTRODUCTION\n\nThe Indian Penal Code was drafted by the First Indian Law Commission presided over by Lord Thomas Babington Macaulay. The draft underwent further revision at the hands of well-known jurists, like Sir Barnes Peacock, and was completed in 1850. The Indian Penal Code was passed by the then Legislature on 6 October 1860 and was enacted as Act No. XLV of 1860.\n\nPreamble.\tWHEREAS it is expedient to provide a general Penal Code for India; It is enacted as foll", "ows:—\nCOMMENT.—The Indian Penal Code, 1860 (IPC, 1860) exhaustively codifies the law relating to offences with which it deals and the rules of the common law cannot be resorted to for inventing exemptions which are not expressly enacted.1. It is not necessary and indeed not permissible to construe the IPC, 1860 at the present day in accordance with the notions of criminal jurisdiction prevailing at the time when the Code was enacted. The notions relating to this matter have very considerably cha", "nged between then and now during nearly a century that has elapsed. It is legitimate to construe the Code with reference to the modern needs, wherever this is permissible, unless there is anything in the Code or in any particular section to indicate the contrary.2.\n\n[s 3] Punishment of offences committed beyond, but which by law may be tried within India.\nAny person liable, by any 36.[Indian law], to be tried for an offence committed beyond 37.[India] shall be dealt with according to the provisi", "ons of this Code for any act committed beyond India in the same manner as if such act had been committed within 38.[India].\n\n\n\n\n\n\n\n1. MC Verghese v Ponnan, AIR 1970 SC 1876 [LNIND 1968 SC 339] : (1969) 1 SCC 37 [LNIND\n1968 SC 339] : 1970 Cr LJ 1651 .\n2. Mobarik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC).\n36. Subs. by the A.O. 1937 for \"law passed by the Governor General of India in Council\".\n37. The original words \"the limits of the said territories\" have su", "ccessively been amended by the A.O. 1937, the A.O. 1948, the A.O. 1950 and Act 3 of 1951, section 3 and Sch (w.e.f. 3 April 1951), to read as above.\n38. The original words \"the said territories\" have successively been amended by the A.O. 1937, the A.O. 1948, the A.O. 1950 and Act 3 of 1951, section 3 and Sch, (w.e.f. 3-4-951) to read as above.\n39. Sheikh Haidar v Syed Issa, (1939) Ngp 241.\n40. Pirtai, (1873) 10 BHC (Cr C) 356.\n41. Pheroze v State of Maharashtra, 1964 (2) Cr LJ 533 (Bom).\n42. Rem", "ia v Sub-Inspector of Police, Tanur, 1993 Cr LJ 1098 (Ker). The court referred to State of WB v Jugal Kishore, AIR 1969 SC 1171 [LNIND 1969 SC 8] : 1969 Cr LJ 1559 .\n43. Souda Beevi v Sub Inspector of Police, 2012 Cr LJ 58 (NOC) : 2011 (4) Ker LT 52 ;\nMuhammad Rafi v State of Kerala, 2010 Cr LJ 592 : 2009 (1) Ker LT 943 ; Vijaya Saradhi Vajja v Devi Sriroopa Madapati, 2007 Cr LJ 636 (AP); Samarudeen v Asst. Director of Enforcement, (1999\n(2) Ker LT 794 [FB]); S Clara v State of TN, 2008 Cr LJ 24", "77 (Mad).\n44. Harihar Narasimha Iyer v State of TN, 2013 Cr LJ 378 ; Rajesh Gupta v State of AP, 2011 Cr LJ 3506 : 2011 (3) Crimes 236 .\n\nTHE INDIAN PENAL CODE\n\nCHAPTER I INTRODUCTION\n\nThe Indian Penal Code was drafted by the First Indian Law Commission presided over by Lord Thomas Babington Macaulay. The draft underwent further revision at the hands of well-known jurists, like Sir Barnes Peacock, and was completed in 1850. The Indian Penal Code was passed by the then Legislature on 6 October 18", "60 and was enacted as Act No. XLV of 1860.\n\nPreamble.\tWHEREAS it is expedient to provide a general Penal Code for India; It is enacted as follows:—\nCOMMENT.—The Indian Penal Code, 1860 (IPC, 1860) exhaustively codifies the law relating to offences with which it deals and the rules of the common law cannot be resorted to for inventing exemptions which are not expressly enacted.1. It is not necessary and indeed not permissible to construe the IPC, 1860 at the present day in accordance with the not", "ions of criminal jurisdiction prevailing at the time when the Code was enacted. The notions relating to this matter have very considerably changed between then and now during nearly a century that has elapsed. It is legitimate to construe the Code with reference to the modern needs, wherever this is permissible, unless there is anything in the Code or in any particular section to indicate the contrary.2.\n\n45.[s 4] Extension of Code to extraterritorial offences.\n\nThe provisions of this Code apply", " also to any offence committed by—\n\n46.[(1) any citizen of India in any place without and beyond India;\n\n(2) any person on any ship or aircraft registered in India wherever it may be;]\n\n47.[(3) any person in any place without and beyond India committing offence targeting a computer resource located in India.]\n48.[Explanation.—In this section—\n\n(a) the word \"offence\" includes every act committed outside India which, if committed in India, would be punishable under this Code;\n(b) the expression \"c", "omputer resource\" shall have the meaning assigned to it in clause ( k ) of sub-section (1) of section 2 of the Information Technology Act, 2000 (21 of 2000).]\n49.[ILLUSTRATION]\n\n50.[***] A, 51.[who is a 52.[citizen of India]], commits a murder in Uganda. He can be tried and convicted of murder in any place in 53.[India] in which he may be found.\n54.[***]\n\n\nCOMMENT—\n\nThis section shows the extent to which the Code applies to offences committed outside India. The Code applies to any offence commit", "ted by—\n\n(1) any citizen of India in any place, wherever he may be;\n(2) any person on any ship or aircraft registered in India wherever it may be; and\n(3) any person, whether or not a citizen of India, who commits any offence, from anywhere in the world, targeting a computer resource located in India.\nHence, except for the case of an offence committed against a computer resource located in India, to extend the scope of operation of IPC, 1860 against persons, either the offender must be a citizen", " of India or he must have committed the offence on any ship or aircraft registered in India.\n\n[s 4.1] Crimes committed outside India.—\n\nWhere an offence is committed beyond the limits of India but the offender is found within its limits, then\n\n(I) he may be given up for trial in the country where the offence was committed (extradition) or\n(II) he may be tried in India (extraterritorial jurisdiction).\n\nWhere an offence was committed by an Indian citizen outside India, it was held that the offence", " was punishable under the IPC, 1860. An investigation of such an offence would not require sanction of the Central Government under the proviso to section 188, Cr PC, 1973. But an enquiry as contemplated by section 202, Cr PC, 1973 could only be with the sanction of the Central Government.55.\n(I) Extradition.—Extradition is the surrender by one State to another of a person desired to be dealt with for crimes of which he has been accused or convicted and which are justiciable in the Courts of the", " other State. Surrender of a person within the State to another State—whether a citizen or an alien—is a political act done in pursuance of a treaty or an arrangement ad hoc.56. Though extradition is granted in implementation of the international commitment of the State, the procedure to be followed by the Courts in deciding, whether extradition should be granted and on what terms, is determined by the municipal law of the land. Extradition is founded on the broad principle that it is in the int", "erest of civilised communities that criminals should not go unpunished and on that account, it is recognised as a part of the comity of nations that one State should ordinarily afford to another State assistance towards bringing offenders to justice.57. The procedure for securing the extradition from India is laid down in the Extradition Act, 1962.\n(II) Extraterritorial jurisdiction.—Indian Courts are empowered to try offences committed out of India on (A) land, (B) high seas or (C) aircraft.\n(A", ") Land.—By virtue of sections 3 and 4 of the Penal Code, and section 188 of the Cr PC, 1973 local Courts can take cognizance of offences committed beyond the territories of India. Where the Court is dealing with an act committed outside India by a citizen of India which would be an offence punishable under the Penal Code if it had been committed in India, section 4 constitutes the act an offence and it can be dealt with under section 188 of the Cr PC, 1973.58. If, however, at the time of commiss", "ion of\n\nthe offence the accused person is not a citizen of India, the provisions of section 4 of the Penal Code and section 188 of the Cr PC, 1973 have no application.59.\nSection 188 of the Cr PC, 1973, provides that when an offence is committed outside India—\n\n(a) by a citizen of India, whether on high seas or elsewhere; or\n(b) by any person not being such citizen on any ship or aircraft registered in India, he may be dealt with in respect of such offence as if it had been committed at any plac", "e within India at which he may be found.\nThe word 'found' in section 188, Cr PC, 1973 means not where a person is discovered but where he is actually present.60. A man brought to a place against his will can be said to be found there.61. When a man is in the country and is charged before a Magistrate with an offence under the Penal Code, it will not avail him to say that he was brought there illegally from a foreign country. The Bombay High Court has laid down this principle, following English p", "recedents, in Savarkar's case.62. The accused Savarkar had escaped at Mareseilles from the custody of police officers charged with the duty of bringing him from London to Bombay, but was re-arrested there and brought to Bombay and committed for trial by the Special Magistrate at Nasik. The High Court held that the trial and committal were valid.63. The provisions of the IPC, 1860 have been extended to offences committed by any citizen of India in any place within and beyond India by virtue of se", "ction 4 thereof. Accordingly, offences committed in Botswana by an Indian citizen would also be amenable to the provisions of the IPC, 1860 subject to the limitation imposed under the proviso to section 188 Cr PC, 1973.64. Section 4 gives extraterritorial jurisdiction but as the Explanation says the acts committed must amount to an offence under the Penal Code.65.\n\n\n\n[s 4.2] Acts done within Indian as well as foreign territory.—\n\nA person who is a citizen of India is liable to be tried by the Co", "urts of this country for acts done by him, partly within and partly without the Indian territories, provided the acts amount together to an offence under the Code.66.\n(B) Admiralty jurisdiction.—The jurisdiction to try offences committed on the high seas is known as the admiralty jurisdiction. It is founded on the principle that a ship on the high seas is a floating island belonging to the nation whose flag she is flying.\nAdmiralty jurisdiction extends over—\n\n(1) Offences committed on Indian shi", "ps on the high seas.\n(2) Offences committed on foreign ships in Indian territorial waters.\n(3) Piracy.\n\nPower to enforce claims against foreign ships is an essential attribute of admiralty jurisdiction and it is assumed over such ships while they are within the jurisdiction of the High Court by arresting and detaining them. Admiralty jurisdiction of the High Courts in India has been historically traced to the Charters of 1774 and 1728, as subsequently expanded and clarified by the Letters Patent", " of 1823, 1862 and 1865 read with the Admiralty Court Act, 1861, the Colonial Courts of Admiralty Act, 1890, and the Colonial Court of Admiralty (India) Act, 1891 and preserved by section 106 of the Government of India Act, 1915, section 223 of the Government of India Act, 1935 and\n\nArticle 225 of the Constitution of India. The pre-Constitution enactments have continued to remain in force in India as existing laws.67.\nThe High Court as a Court of Admiralty is treated as a separate entity exercis", "ing a distinct and specific or prescribed or limited jurisdiction. This reasoning is based on the assumption that the continuance in force of the Colonial Courts of Admiralty Act, 1890 as an existing law carves out a distinct jurisdiction of the High Court limited in ambit and efficacy to what has been granted by the Admiralty Court Act 1861, and that jurisdiction has remained stultified ever since. This restrictive construction is not warranted by the provisions of the Constitution. Accordingly", ", a foreign ship falls within the jurisdiction of the High Court where the vessel happens to be at the relevant time, i.e., at the time when the jurisdiction of the High Court is invoked, or, where the cause of action wholly or in part arises. The Merchant Shipping Act empowers the concerned High Court to arrest a ship in respect of a substantive right. This jurisdiction can be assumed by the concerned High Court, whether or not the defendant resides or carries on business, or the cause of actio", "n arose wholly or in part, within the local limits of its jurisdiction. Once a foreign ship is arrested within the local limits of the jurisdiction of the High Court, and the owner of the ship has entered appearance and furnished security to the satisfaction of the High Court for the release of the ship, the proceedings continue as a personal action. The conclusion is that all the High Courts in India have inherent admiralty jurisdiction and can invoke the same for the enforcement of a maritime ", "claim.68.\nEven while exercising extraordinary powers available under the Constitution the jurisdiction of the High Court is primarily circumscribed by its territorial limits, viz., the jurisdiction has to be in context of the territorial jurisdiction available to the High Court. If the overall scheme of IPC, 1860 (section 4), Cr PC, 1973 (section 188), The Merchant Shipping Act, 1958 (section 437) and the Territorial Waters Act, 1976 (section 13) are taken into consideration read with sections 2", "(2) and 3(15) of the Merchant Shipping Act, it is apparent that for a Court, including High Court, to be vested with jurisdiction, an offender or offending vessel have to be found within local territorial limits of such Court.69.\n\n\n\n[s 4.3] Piracy\n\nPiracy consists of any of the following acts:\n\n(a) any illegal acts of violence or detention, or any act of depredation, committed for private ends by the crew or the passengers of a private ship or a private aircraft, and directed:\n(i) on the high se", "as, against another ship or aircraft, or against persons or property on board such ship or aircraft;\n(ii) against a ship, aircraft, persons or property in a place outside the jurisdiction of any State;\n(b) any act of voluntary participation in the operation of a ship or of an aircraft with knowledge of facts making it a pirate ship or aircraft;\n(c) any act of inciting or of intentionally facilitating an act described in subparagraph (a) or (b).70.\nThe Convention on the Law of Sea known as United", " National Convention on the Law of Sea, 1982 (UNCLOS) sets out the legal framework applicable to combating piracy and armed robbery at sea, as well as other ocean activities. UNCLOS, 1982 is a\n\ncomprehensive code on the international law of sea. It codifies and consolidates the traditional law within a single, unificatory legal framework. It has changed the legal concept of continental shelf and also introduced a new maritime zone known as exclusive economic zone. Exclusive economic zone is a ne", "w concept having several new features.71. The UNCLOS signed by India in 1982 and ratified on 29 June 1995, encapsulates the law of the sea and is supplemented by several subsequent resolutions adopted by the Security Council of the United Nations.\nBefore UNCLOS came into existence, the law relating to the seas which was in operation in India, was the Territorial Waters, Continental Shelf, Exclusive Economic Zone and Other Maritime Zones Act, 1976, which spelt out the jurisdiction of the Central ", "Government over the Territorial Waters, the Contiguous Zones and the Exclusive Economic Zone. The provisions of the UNCLOS are in harmony with and not in conflict with the provisions of the Maritime Zones Act, 1976, in this regard. Article 33 of the Convention recognises and describes the Contiguous Zone of a nation to extend to 24 nautical miles from the baseline from which the breadth of the territorial sea is measured. Similarly, Articles 56 and 57 describe the rights, jurisdiction and duties", " of the coastal State in the Exclusive Economic Zone and the breadth thereof extending to 20 nautical miles from the baseline from which the breadth of the territorial sea is measured. This provision is also in consonance with the provisions of the 1976 Act. The area of difference between the provisions of the Maritime Zones Act, 1976, and the Convention occurs in Article 97 of the Convention which relates to the penal jurisdiction in matters of collision or any other incident of navigation.72.\n", "\n\n\n[s 4.4] Jurisdiction of Indian High Courts.—\n\nIn view of the declaration of law made by the Supreme Court in M V Elisabeth v Harwan Investment and Trading,73. the High Courts in India have inherent admiralty jurisdiction.\nThe offences which come within the admiralty jurisdiction are now defined by the Merchant Shipping Act, 1958.\n(C) Aircraft.—The provisions of the Code are made applicable to any offence committed by any person on any aircraft registered in India, wherever it may be.\n\n\n\n[s 4.", "5] Liability of foreigners in India for offences committed outside its limits.\n—\n\nThe acts of a foreigner committed by him in territory beyond the limits of India do not constitute an offence against the Penal Code, and, consequently, a foreigner cannot be held criminally responsible under that Code by the tribunals of India for acts committed by him beyond its territorial limits. Thus, when it is sought to punish a person, who is not an Indian subject, as an offender in respect of a certain act", ", the question is not 'where was the act committed,' but 'was that person at the time, when the act was done, within the territory of India'. For, if he was not, the act is not an offence, the doer of it is not liable to be punished as an offender, and he is, therefore, not subject to the jurisdiction of criminal Courts.74. But if a foreigner in a foreign territory initiates an offence which is completed within Indian territory, he is, if found within Indian territory, liable to be tried by the ", "Indian Court within whose jurisdiction the offence was completed.75.\n\n\n\n\n\n1. MC Verghese v Ponnan, AIR 1970 SC 1876 [LNIND 1968 SC 339] : (1969) 1 SCC 37 [LNIND\n1968 SC 339] : 1970 Cr LJ 1651 .\n2. Mobarik Ali v State of Bombay, AIR 1957 SC 857 [LNIND 1957 SC 81] : 1957 Cr LJ 1346 (SC).\n45. Subs. by Act 4 of 1898, section 2, for section 4.\n46. Subs. by the A.O. 1950, for clauses (1) to (4).\n47. Ins. by the Information Technology (Amendment) Act, 2008 (10 of 2009), section 51(a)(i) (w.e.f. 27-10- ", "2009).\n48. Subs. by the Information Technology (Amendment) Act, 2008 (10 of 2009), section 51(a)(ii),\nfor Explanation (w.e.f. 27-10-2009). Explanation, before substitution, stood as under: \"Explanation.—In this section the word \"offence\" includes every act committed outside India which, if committed in India, would be punishable under this Code.\"\n49. Subs. by Act 36 of 1957, section 3 and Sch II, for \"Illustrations\" (w.e.f. 17-9-1957).\n50. The brackets and letter \"(a)\" omitted by Act 36 of 1957,", " section 3 and Sch II (w.e.f. 17-9- 1957).\n51. Subs. by the A.O. 1948, for \"a coolie, who is a Native Indian subject\".\n52. Subs. by the A.O. 1950, for \"a British subject of Indian domicile\".\n53. The words \"British India\" have been successively amended by the A.O. 1948, the A.O. 1950 and Act 3 of 1951, section 3 and Sch (w.e.f. 1-4-1951), to read as above.\n54. Illustrations (b), (c) and (d) omitted by the A.O. 1950.\n55. Muhammad Rafi v State of Kerala, 2010 Cr LJ 592 Ker DB.\n56. State of WB v Jug", "al Kishore More, (1969) 3 SCR 320 [LNIND 1969 SC 8] : 1969 Cr LJ 1559 :\nAIR 1969 SC 1171 [LNIND 1969 SC 8] .\n57. Abu Salem Abdul Qayoom Ansari v State of Maharashtra, JT 2010 (10) SC 202 [LNIND 2010 SC 858] : 2010 (9) Scale 460 : (2011) 3 SCC (Cr) 125 : (2011) 11 SCC 214 [LNIND 2010 SC 858] .\n58. Ajay Aggarwal v UOI, 1993 (3) SCC 609 [LNIND 1993 SC 431] : AIR 1993 SC 1637 [LNIND\n1993 SC 431] : 1993 Cr LJ 2516 .\n59. Central Bank of India Ltd v Ram Narain, (1955) 1 SCR 697 [LNIND 1954 SC 126] : 19", "55 Cr LJ\n152 : AIR 1955 SC 36 [LNIND 1954 SC 126] .\n60. Maganlal v State, (1882) 6 Bom 622.\n61. Lopez and Sattler, (1858) 27 LJ (MC) 48.\n62. Vinayak D Savarkar, (1910) 13 Bom LR 296 , 35 Bom 225.\n\n63. Supra. Also see Om Hemrajani v State of UP, (2005) 1 SCC 617 [LNIND 2004 SC 1181] : AIR 2005 SC 392 [LNIND 2004 SC 1181] .\n64. Thota Venkateswarlu v State of AP, AIR 2011 SC 2900 [LNIND 2011 SC 850] : (2011) 9 SCC\n527 [LNIND 2011 SC 850] : 2011 Cr LJ 4925 : (2011) 3 SCC (Cr) 772.\n65. Rambharthi, (1", "923) 25 Bom LR 772 [LNIND 1923 BOM 115] : 47 Bom 907; Sheikh Haidar v\nSyed Issa, (1939) Nag 241.\n66. Moulivie Ahmudoollah, (1865) 2 WR (Cr) 60.\n67. See Kamalakar Mahadev Bhagat v Scindia Steam Navigation Co Ltd, AIR 1961 Bom 186 [LNIND 1960 BOM 71] : (1960) 62 Bom LR 995 ; Sahida Ismail v Petko R Salvejkov, AIR 1973 Bom 18 [LNIND 1971 BOM 74] : (1972) 74 Bom LR 514 ; Jayaswal Shipping Co v SS Leelavati, AIR\n1954 Cal 415 [LNIND 1953 CAL 202] ; Reena Padhi v 'Jagdhir', AIR 1982 Ori 57 [LNIND 1981 ", "ORI\n93] .\n68. M V Elisabeth v Harwan Investment and Trading, 1993 Supp (2) SCC 433 : AIR 1993 SC 1014 [LNIND 1992 SC 194] ; MV Al Quamar v Tsavliris Salvage (International) Ltd, AIR 2000 SC 2826 [LNIND 2000 SC 1119] : (2000) 8 SCC 278 [LNIND 2000 SC 1119] : 2000 (5) Scale 618 [LNIND\n2000 SC 1119] ; MV Free Neptune v DLF Southern Towns Private, 2011 (1) Ker LT 904 : 2011 (1)\nKHC 628 .\n69. MG Forests Pte Ltd v \"MV Project Workship\", Gujarat High Court Judgement dated 24 February 2004.\n70. Article ", "100. United Nations Convention on the Law of the Sea (UNCLOS), 1982.\n71. Aban Loyd Chiles Offshore Ltd v UOI, JT 2008 (5) SC 256 [LNIND 2008 SC 897] : 2008 (6)\nScale 128 [LNIND 2008 SC 897] : (2008) 11 SCC 439 [LNIND 2008 SC 897] .\n72. Republic of Italy through Ambassador v UOI, (2013) 4 SCC 721 : 2013 (1) Scale 462\n[LNINDORD 2013 SC 9114] .\n73. M V Elisabeth v Harwan Investment and Trading, 1993 Supp (2) SCC 433 : AIR 1993 SC 1014\n[LNIND 1992 SC 194] .\n74. Musst. Kishen Kour, (1878) PR No. 20 o", "f 1878; Jameson, (1896) 2 QB 425 .\n75. Chhotalal, (1912) 14 Bom LR 147 [LNIND 1912 BOM 26] .\n76. P T Abdul Rahiman v State of Kerala, 2013 Cr LJ 893 (Ker).\n\nTHE INDIAN PENAL CODE\n\nCHAPTER I INTRODUCTION\n\nThe Indian Penal Code was drafted by the First Indian Law Commission presided over by Lord Thomas Babington Macaulay. The draft underwent further revision at the hands of well-known jurists, like Sir Barnes Peacock, and was completed in 1850. The Indian Penal Code was passed by the then Legislat", "ure on 6 October 1860 and was enacted as Act No. XLV of 1860.\n\nPreamble.\tWHEREAS it is expedient to provide a general Penal Code for India; It is enacted as follows:—\nCOMMENT.—The Indian Penal Code, 1860 (IPC, 1860) exhaustively codifies the law relating to offences with which it deals and the rules of the common law cannot be resorted to for inventing exemptions which are not expressly enacted.1. It is not necessary and indeed not permissible to construe the IPC, 1860 at the present day in acco", "rdance with the notions of criminal jurisdiction prevailing at the time when the Code was enacted. The notions relating to this matter have very considerably changed between then and now during nearly a century that has elapsed. It is legitimate to construe the Code with reference to the modern needs, wherever this is permissible, unless there is anything in the Code or in any particular section to indicate the contrary.2.\n\n77.[[s 5] Certain laws not to be affected by this Act.\n\nNothing in this ", "Act shall affect the provisions of any Act for punishing mutiny and desertion of oﬃcers, soldiers, sailors or airmen in the service of the Government of India or the provisions of any special or local law 1 .]\n\n\n\nCOMMENT—\n\nThis section is a saving clause to section 2. Though the Code was intended to be a general one, it was not thought desirable to make it exhaustive, and hence, offences defined by local and special laws were left out of the Code, and merely declared to be punishable as theretof", "ore.78. Thus, the personnel of the Army, Navy and Airforce are governed by the provisions of the Army Act, 1950, The Navy Act, 1957, and The Indian Air Force Act, 1950 in regard to offences of mutiny and desertion committed by them.79.\n1. 'Special or local law'.—A special law is a law relating to a particular subject;80. whereas a local law is a law which applies only to a particular part of the country.81. The distinction between a statute creating a new offence with a particular penalty and a ", "statute enlarging the ambit of an existing offence by including new acts within it with a particular penalty is well settled. In the former case the new offence is punishable by the new penalty only; in the latter it is punishable also by all such penalties as were applicable before the Act to the offence in which it is included. The Principle is that where a new offence is created and the particular manner in which proceedings should be taken is laid down, then proceedings cannot be taken in an", "y other way.82. However, a person cannot be punished under both the Penal Code and a special law for the same\n\noffence,83. and ordinarily the sentence should be under the special Act.84. This is, however, confined to cases where the offences are coincident or practically so.85.\nThe Supreme Court issued specific guidelines regarding the interpretation of general law and special law. See the Box below for these Guidelines.\nSupreme Court Guidelines on Interpretation of General law and Special law\n\n", "(i) When a provision of law regulates a particular subject and a subsequent law contains a provision regulating the same subject, there is no presumption that the later law repeals the earlier law. The rule-making authority while making the later rule is deemed to know the existing law on the subject. If the subsequent law does not repeal the earlier rule, there can be no presumption of an intention to repeal the earlier rule;\n(ii) When two provisions of law — one being a general law and the oth", "er being special law govern a matter, the court should endeavour to apply a harmonious construction to the said provisions. But where the intention of the rule-making authority is made clear either expressly or impliedly, as to which law should prevail, the same shall be given effect.\n(iii) If the repugnancy or inconsistency subsists in spite of an effort to read them harmoniously, the prior special law is not presumed to be repealed by the later general law. The prior special law will continue ", "to apply and prevail in spite of the subsequent general law. But where a clear intention to make a rule of universal application by superseding the earlier special law is evident from the later general law, then the later general law, will prevail over the prior special law.\n(iv) Where a later special law is repugnant to or inconsistent with an earlier general law, the later special law will prevail over the earlier general law.\n\n[Maya Mathew v State of Kerala86. and P Raghava Kurup v V Ananthak", "umari87..]\n\n[s 5.1] Contempt of Court\n\nContempt of Courts Act, 1971 (Act 70 of 1971) makes it clear that, Contempt of Court means 'Civil contempt' or 'Criminal contempt'.88. 'Civil contempt' means wilful disobedience to any judgment, decree, direction, order, writ or other process of a Court or wilful breach of an Undertaking given to a Court.89. \"Criminal contempt\" means the publication (whether by words, spoken or written, or by signs, or by visible representations, or otherwise) of any matter", " or the doing of any other act whatsoever which – (i) scandalises or tends to scandalise or lowers or tends to lower the authority of any Court; or (ii) prejudices, or interferes or tends to interfere with, the due course of any judicial proceeding; or (iii) interferes or tends to interfere with, or obstructs or tends to obstruct, the administration of justice in any other manner.90. The provisions of this Act shall be in addition to and not in derogation of, the provisions of any other law rela", "ting to contempt of Courts.91. Contempt proceeding is sui generis (of its own kind or class or unique). It has peculiar features which are not found in criminal proceedings. The respondent does not stand in the position of a person accused of an offence. Initiation of contempt proceedings against the respondent who is already accused in a criminal proceedings, does not amount to double jeopardy.92. Mens rea is not necessary for committing contempt of Court. The main ingredient of the offence of "], "dimension": 384, "total_vectors": 100}